import React, {Component} from "react";
import "../css/agr.css";
export default class UserAgr extends Component {
    render() {
        return (
            <section className="agreement">
                <h1 className="title">用户协议</h1>
                <div className="detail">
                    <h2 className="hd">一、总则</h2>
                    <p className="text">
                        1．1　用户应当同意本协议的条款并按照页面上的提示完成全部的注册程序。用户在进行注册程序过程中点击"开始写协议"按钮即表示用户与写协议达成协议，完全接受本协议项下的全部条款。
                        <br />1．2　用户一经注册写协议帐号，除非子频道要求单独开通权限，用户有权利用该帐号使用写协议各个频道的单项服务，当用户使用写协议各单项服务时，用户的使用行为视为其对该单项服务的服务条款以及写协议在该单项服务中发出的各类公告的同意。
                        <br />1．3　写协议会员服务协议以及各个频道单项服务条款和公告可由写协议定时更新，并予以公示。您在使用相关服务时,应关注并遵守其所适用的相关条款。
                    </p>
                </div>
                <div className="detail">
                    <h2 className="hd">二、注册信息和隐私保护</h2>
                    <p className="text">
                        2．1　写协议帐号（即写协议用户ID）的所有权归写协议，用户按注册页面引导填写信息，阅读并同意本协议且完成全部注册程序后，即可获得写协议帐号并成为写协议用户。用户应提供及时、详尽及准确的个人资料，并不断更新注册资料，符合及时、详尽准确的要求。所有原始键入的资料将引用为注册资料。如果因注册信息不真实或更新不及时而引发的相关问题，写协议不负任何责任。您可以通过写协议帐号设置页面查询、更正您的信息，写协议帐号设置页面地址：用户应当通过真实身份信息认证注册帐号，且用户提交的帐号名称、头像和简介等注册信息中不得出现违法和不良信息，经写协议审核，如存在上述情况，写协议将不予注册；同时，在注册后，如发现用户以虚假信息骗取帐号名称注册，或其帐号头像、简介等注册信息存在违法和不良信息的，写协议有权不经通知单方采取限期改正、暂停使用、注销登记、收回等措施。
                        <br />2．2　写协议帐号包括帐户名称和密码，您可使用设置的帐户名称（包括用户名、手机号、邮箱）和密码登录写协议；在帐号使用过程中，为了保障您的帐号安全基于不同的终端以及您的使用习惯，我们可能采取不同的验证措施识别您的身份。例如您的帐户在新设备首次登录，我们可能通过密码加校验码的方式识别您的身份，验证方式包括但不限于短信验证码、服务使用信息验证。
                        <br />2．3　用户不应将其帐号、密码转让、出售或出借予他人使用，若用户授权他人使用帐户，应对被授权人在该帐户下发生所有行为负全部责任。由于帐号关联用户使用信息，仅当依法律法规、司法裁定或经写协议同意，并符合写协议规定的用户帐号转让流程的情况下，方可进行帐号的转让。
                        <br />2．4　因您个人原因导致的帐号信息遗失，如需找回写协议帐号信息，请按照写协议帐号找回要求提供相应的信息，并确保提供的信息合法真实有效，若提供的信息不符合要求，无法通过写协议安全验证，写协议有权拒绝提供帐号找回服务；若帐号的唯一凭证不再有效，写协议有权拒绝支持帐号找回。例如手机号二次出售，写协议可拒绝支持帮助找回原手机号绑定的帐号。
                        <br />2．5　在需要终止使用写协议帐号服务时，符合以下条件的，您可以申请注销您的写协议帐号。
                        <br />（1）您仅能申请注销您本人的帐号，并依照写协议的流程进行注销；
                        <br />（2）您仍应对您在注销帐号前且使用写协议服务期间的行为承担相应责任，同时写协议仍可保存您注销前的相关信息；
                        <br />（3）注销成功后，帐号信息、个人身份证信息、交易记录、会员权益等将无法恢复或提供；
                        <br />2．6　为了防止资源占用，如您连续六个月未使用您的写协议帐号或未通过写协议认可的其他方式登录过您的写协议帐户，写协议有权对该帐户进行注销，您将不能再通过该帐号登录名登录本网站或使用相关服务。如该帐户有关联的理财产品、待处理交易或余额，写协议会在合理范围内协助您处理，请您按照写协议提示的方式进行操作。
                        <br />2．7　当您使用写协议产品进行支付、登录等操作的时候，服务器会自动接收、验证、并记录一些必要的信息，如手机号码、IP地址、服务访问异常信息、以及部分设备信息等，以保障您在使用写协议服务时账户登录和支付过程的安全，进而保护您的上网安全。您使用写协议的服务，即表示您同意写协议可以按照相关的隐私权政策处理您的个人信息。写协议可能会与合作伙伴共同向您提供您所要求的服务或者共同向您展示您可能感兴趣的内容。在信息为该项产品/服务所必须的情况下，您同意写协议可与其分享必要的信息。并且，写协议会要求其确保数据安全并且禁止用于任何其他用途。除此之外，写协议不会向任何无关第三方提供或分享信息。
                        <br />2．8　在如下情况下，写协议可能会披露您的信息:
                        <br />（1）事先获得您的授权；
                        <br />（2）您使用共享功能；
                        <br />（3）根据法律、法规、法律程序的要求或政府主管部门的强制性要求；
                        <br />（4）以学术研究或公共利益为目的；
                        <br />（5）为维护写协议的合法权益，例如查找、预防、处理欺诈或安全方面的问题；
                        <br />（6）符合相关服务条款或使用协议的规定。
                        <br />2．9　您知悉并授权，写协议仅在必需的情况下使用或与关联公司同步您的信息，以为用户提供征信相关服务。
                        <br />2．10　为更好地向用户提供服务，您同意写协议通过短信等形式向您发送相关商业性服务信息。
                    </p>
                </div>
                <div className="detail">
                    <h2 className="hd">三、使用规则</h2>
                    <p className="text">
                        3．1　用户在使用写协议服务时，必须遵守《网络安全法》、《互联网新闻信息服务管理规定》等中华人民共和国相关法律法规的规定，用户应同意将不会利用本服务进行任何违法或不正当的活动，包括但不限于下列行为:
                        <br />（1）上载、展示、张贴、传播或以其它方式传送含有下列内容之一的信息：
                        <br />　　1）反对宪法所确定的基本原则的；
                        <br />　　2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
                        <br />　　3）损害国家荣誉和利益的；
                        <br />　　4）煽动民族仇恨、民族歧视、破坏民族团结的；
                        <br />　　5）破坏国家宗教政策，宣扬邪教和封建迷信的；
                        <br />　　6）散布谣言，扰乱社会秩序，破坏社会稳定的；
                        <br />　　7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
                        <br />　　8）侮辱或者诽谤他人，侵害他人合法权利的；
                        <br />　　9）含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；
                        <br />　　10）含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的；
                        <br />（2）不得为任何非法目的而使用网络服务系统；
                        <br />（3）不利用写协议服务从事以下活动：
                        <br />　　1) 未经允许，进入计算机信息网络或者使用计算机信息网络资源的；
                        <br />　　2) 未经允许，对计算机信息网络功能进行删除、修改或者增加的；
                        <br />　　3)
                        未经允许，对进入计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、修改或者增加的；
                        <br />　　4) 故意制作、传播计算机病毒等破坏性程序的；
                        <br />　　5) 其他危害计算机信息网络安全的行为。
                        <br />3．2　用户违反本协议或相关的服务条款的规定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费，您同意赔偿写协议与合作公司、关联公司，并使之免受损害。对此，写协议有权视用户的行为性质，采取包括但不限于删除用户发布信息内容、暂停使用许可、终止服务、限制使用、回收写协议帐号、追究法律责任等措施。对恶意注册写协议帐号或利用写协议帐号进行违法活动、捣乱、骚扰、欺骗、其他用户以及其他违反本协议的行为，写协议有权回收其帐号。同时，写协议会视司法部门的要求，协助调查。
                        <br />3．3　用户不得对本服务任何部分或本服务之使用或获得，进行复制、拷贝、出售、转售或用于任何其它商业目的。
                        <br />3．4　用户须对自己在使用写协议服务过程中的行为承担法律责任。用户承担法律责任的形式包括但不限于：对受到侵害者进行赔偿，以及在写协议首先承担了因用户行为导致的行政处罚或侵权损害赔偿责任后，用户应给予写协议等额的赔偿。
                        <br />3．5　用户在使用写协议服务时遵守以下互联网底线：
                        <br />　　1）法律法规底线
                        <br />　　2）社会主义制度底线
                        <br />　　3）国家利益底线
                        <br />　　4）公民合法权益底线
                        <br />　　5）社会公共秩序底线
                        <br />　　6）道德风尚底线
                        <br />　　7）信息真实性底线
                    </p>
                </div>
                <div className="detail">
                    <h2 className="hd">四、服务内容</h2>
                    <p className="text">
                        <br />4．1　写协议网络服务的具体内容由写协议根据实际情况提供。
                        <br />4．2　除非本服务协议另有其它明示规定，写协议所推出的新产品、新功能、新服务，均受到本服务协议之规范。
                        <br />4．3　为使用本服务，您必须能够自行经有法律资格对您提供互联网接入服务的第三方，进入国际互联网，并应自行支付相关服务费用。此外，您必须自行配备及负责与国际联网连线所需之一切必要装备，包括计算机、数据机或其它存取装置。
                        <br />4．4　鉴于网络服务的特殊性，用户同意写协议有权不经事先通知，随时变更、中断或终止部分或全部的网络服务（包括收费网络服务）。写协议不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。
                        <br />4．5　免责声明：因以下情况造成网络服务在合理时间内的中断，写协议无需为此承担任何责任；
                        <br />（1）写协议需要定期或不定期地对提供网络服务的平台或相关的设备进行检修或者维护，写协议保留不经事先通知为维修保养、升级或其它目的暂停本服务任何部分的权利。
                        <br />（2）因台风、地震、洪水、雷电或恐怖袭击等不可抗力原因；
                        <br />（3）用户的电脑软硬件和通信线路、供电线路出现故障的；
                        <br />（4）因病毒、木马、恶意程序攻击、网络拥堵、系统不稳定、系统或设备故障、通讯故障、电力故障、银行原因、第三方服务瑕疵或政府行为等原因。
                        尽管有前款约定，写协议将采取合理行动积极促使服务恢复正常。
                        <br />4．6　本服务或第三人可提供与其它国际互联网上之网站或资源之链接。由于写协议无法控制这些网站及资源，您了解并同意，此类网站或资源是否可供利用，写协议不予负责，存在或源于此类网站或资源之任何内容、广告、产品或其它资料，写协议亦不予保证或负责。因使用或依赖任何此类网站或资源发布的或经由此类网站或资源获得的任何内容、商品或服务所产生的任何损害或损失，写协议不承担任何责任。
                        <br />4．7　用户明确同意其使用写协议网络服务所存在的风险将完全由其自己承担。用户理解并接受下载或通过写协议服务取得的任何信息资料取决于用户自己，并由其承担系统受损、资料丢失以及其它任何风险。写协议对在服务网上得到的任何商品购物服务、交易进程、招聘信息，都不作担保。
                        <br />4．8　用户须知：写协议提供的各种挖掘推送服务中（包括写协议新首页的导航网址推送），推送给用户曾经访问过的网站或资源之链接是基于机器算法自动推出，写协议不对其内容的有效性、安全性、合法性等做任何担保。
                        <br />4．9　写协议有权于任何时间暂时或永久修改或终止本服务（或其任何部分），而无论其通知与否，写协议对用户和任何第三人均无需承担任何责任。
                        <br />4．10　终止服务
                        <br />您同意写协议得基于其自行之考虑，因任何理由，包含但不限于长时间（超过一年）未使用，或写协议认为您已经违反本服务协议的文字及精神，终止您的密码、帐号或本服务之使用（或服务之任何部分），并将您在本服务内任何内容加以移除并删除。您同意依本服务协议任何规定提供之本服务，无需进行事先通知即可中断或终止，您承认并同意，写协议可立即关闭或删除您的帐号及您帐号中所有相关信息及文件，及/或禁止继续使用前述文件或本服务。此外，您同意若本服务之使用被中断或终止或您的帐号及相关信息和文件被关闭或删除，写协议对您或任何第三人均不承担任何责任。
                    </p>
                </div>
                <div className="detail">
                    <h2 className="hd">五、知识产权和其他合法权益（包括但不限于名誉权、商誉权</h2>
                    <p className="text">
                        <br />5．1　用户专属权利
                        <br />写协议尊重他人知识产权和合法权益，呼吁用户也要同样尊重知识产权和他人合法权益。若您认为您的知识产权或其他合法权益被侵犯，请按照以下说明向写协议提供资料∶
                        请注意：如果权利通知的陈述失实，权利通知提交者将承担对由此造成的全部法律责任（包括但不限于赔偿各种费用及律师费）。如果上述个人或单位不确定网络上可获取的资料是否侵犯了其知识产权和其他合法权益，写协议建议该个人或单位首先咨询专业人士。
                        为了写协议有效处理上述个人或单位的权利通知，请使用以下格式（包括各条款的序号）：
                        <br />1.
                        权利人对涉嫌侵权内容拥有知识产权或其他合法权益和/或依法可以行使知识产权或其他合法权益的权属证明；
                        <br />2.
                        请充分、明确地描述被侵犯了知识产权或其他合法权益的情况并请提供涉嫌侵权的第三方网址（如果有）。
                        <br />3. 请指明涉嫌侵权网页的哪些内容侵犯了第2项中列明的权利。
                        <br />4.
                        请提供权利人具体的联络信息，包括姓名、身份证或护照复印件（对自然人）、单位登记证明复印件（对单位）、通信地址、电话号码、传真和电子邮件。
                        <br />5.
                        请提供涉嫌侵权内容在信息网络上的位置（如指明您举报的含有侵权内容的出处，即：指网页地址或网页内的位置）以便我们与您举报的含有侵权内容的网页的所有权人/管理人联系。
                        <br />6. 请在权利通知中加入如下关于通知内容真实性的声明：
                        “我保证，本通知中所述信息是充分、真实、准确的，如果本权利通知内容不完全属实，本人将承担由此产生的一切法律责任。”
                        <br />7　对于用户通过写协议服务（包括但不限于贴吧、知道、写协议云等）上传到写协议网站上可公开获取区域的任何内容，用户同意写协议在全世界范围内具有免费的、永久性的、不可撤销的、非独家的和完全再许可的权利和许可，以使用、复制、修改、改编、出版、翻译、据以创作衍生作品、传播、表演和展示此等内容（整体或部分），和/或将此等内容编入当前已知的或以后开发的其他任何形式的作品、媒体或技术中。
                        <br />8　写协议拥有本网站内所有资料的版权。任何被授权的浏览、复制、打印和传播属于本网站内的资料必须符合以下条件：
                        <br />　　所有的资料和图象均以获得信息为目的；
                        <br />　　所有的资料和图象均不得用于商业目的；
                        <br />　　所有的资料、图象及其任何部分都必须包括此版权声明；
                        <br />　　本网站（www.xiexieyi.com）所有的产品、技术与所有程序均属于写协议知识产权，在此并未授权。　　“xiexieyi”,
                        “写协议”及相关图形等为写协议的注册商标。
                        <br />　　未经写协议许可，任何人不得擅自（包括但不限于：以非法的方式复制、传播、展示、镜像、上载、下载）使用。否则，写协议将依法追究法律责任。
                        <br />
                    </p>
                </div>
                <div className="detail">
                    <h2 className="hd">六、青少年用户特别提示</h2>
                    <p className="text">
                        青少年用户必须遵守全国青少年网络文明公约：<br />
                        要善于网上学习，不浏览不良信息；要诚实友好交流，不侮辱欺诈他人；要增强自护意识，不随意约会网友；要维护网络安全，不破坏网络秩序；要有益身心健康，不沉溺虚拟时空。
                    </p>
                </div>
                <div className="detail">
                    <h2 className="hd">七、其他</h2>
                    <p className="text">
                        <br />7．1　本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律。
                        <br />7．2　如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向写协议所在地佛山市禅城区人民法院提起诉讼。
                        <br />7．3　写协议未行使或执行本服务协议任何权利或规定，不构成对前述权利或权利之放弃。
                        <br />7．4　如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。
                        <br />请您在发现任何违反本服务协议以及其他任何单项服务的服务条款、写协议各类公告之情形时，通知写协议。您可以通过如下联络方式同写协议联系：
                        写协议　产品事务组
                    </p>
                </div>
            </section>
        );
    }
}
